tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/S12_identity_grant_anon.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 05:43:03.727761870 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/S12_identity_grant_anon/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 06:33:46.672619704 +0000
@@ -105,7 +105,7 @@
   'Highest free_rating_ledger count across the CALLER''s auth.identities rows (0 when none). Definer so it can read the service-only ledger; takes no arguments so it can never be pointed at another user.';
 
 revoke all on function public.identity_scored_count() from public, anon;
-grant execute on function public.identity_scored_count() to authenticated;
+grant execute on function public.identity_scored_count() to authenticated, anon;
 
 -- ---------------------------------------------------------------------------
 -- 4. lifetime_scored_count() — THE count every free-rating decision uses.
