tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/S19_trigger_security_invoker.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 05:43:03.727761870 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/S19_trigger_security_invoker/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 06:34:53.848622908 +0000
@@ -149,7 +149,7 @@
 create or replace function public.record_scored_shot_in_ledger()
 returns trigger
 language plpgsql
-security definer
+security invoker
 set search_path = ''
 as $$
 declare
