tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/S04_lifetime_counts_non_scored.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 05:43:03.727761870 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/S04_lifetime_counts_non_scored/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 06:32:34.596616267 +0000
@@ -124,7 +124,7 @@
   select greatest(
     (
       select count(*)::int from public.shots s
-      where s.user_id = (select auth.uid()) and s.result_kind = 'scored'
+      where s.user_id = (select auth.uid()) and s.result_kind <> 'scored'
     ),
     public.identity_scored_count()
   )
