tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/S06_lifetime_minus_one.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 05:43:03.727761870 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/S06_lifetime_minus_one/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 06:32:52.372617115 +0000
@@ -121,13 +121,13 @@
 security invoker
 set search_path = ''
 as $$
-  select greatest(
+  select greatest(0, (  select greatest(
     (
       select count(*)::int from public.shots s
       where s.user_id = (select auth.uid()) and s.result_kind = 'scored'
     ),
     public.identity_scored_count()
-  )
+  )) - 1)
 $$;
 
 comment on function public.lifetime_scored_count() is
