tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/S08_identity_max_to_min.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 05:43:03.727761870 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/S08_identity_max_to_min/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 06:33:11.212618013 +0000
@@ -94,7 +94,7 @@
 security definer
 set search_path = ''
 as $$
-  select coalesce(max(l.scored_count), 0)::int
+  select coalesce(min(l.scored_count), 0)::int
   from auth.identities i
   join public.free_rating_ledger l
     on l.identity_hash = public.free_rating_identity_hash(i.provider, i.provider_id)
