tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/S53_ledger_grant_insert_update_delete.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 05:43:03.727761870 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/S53_ledger_grant_insert_update_delete/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 06:40:17.564638343 +0000
@@ -59,6 +59,7 @@
 
 alter table public.free_rating_ledger enable row level security;
 revoke all on public.free_rating_ledger from public, anon, authenticated;
+grant insert, update, delete on public.free_rating_ledger to authenticated;
 
 -- ---------------------------------------------------------------------------
 -- 2. Hash helper — the ONE definition of the ledger key. Not client-callable.
