tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/S16_trigger_conflict_no_plus_one.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 05:43:03.727761870 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/S16_trigger_conflict_no_plus_one/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 06:34:25.280621545 +0000
@@ -171,7 +171,7 @@
   from auth.identities i
   where i.user_id = new.user_id
   on conflict (identity_hash) do update
-    set scored_count = greatest(led.scored_count + 1, excluded.scored_count),
+    set scored_count = greatest(led.scored_count, excluded.scored_count),
         updated_at = now();
 
   return new;
