tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/S17_trigger_insert_only.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 05:43:03.727761870 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/S17_trigger_insert_only/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 06:34:34.784621998 +0000
@@ -183,7 +183,7 @@
 
 drop trigger if exists shots_record_free_rating_ledger on public.shots;
 create trigger shots_record_free_rating_ledger
-  after insert or update of result_kind on public.shots
+  after insert on public.shots
   for each row execute function public.record_scored_shot_in_ledger();
 
 -- ---------------------------------------------------------------------------
