tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/S20_trigger_next_unscoped.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 05:43:03.727761870 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/S20_trigger_next_unscoped/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 06:34:59.992623200 +0000
@@ -164,7 +164,7 @@
   from auth.identities i
   join public.free_rating_ledger l
     on l.identity_hash = public.free_rating_identity_hash(i.provider, i.provider_id)
-  where i.user_id = new.user_id;
+  ;
 
   insert into public.free_rating_ledger as led (identity_hash, scored_count)
   select public.free_rating_identity_hash(i.provider, i.provider_id), v_next
