tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/S22_ledger_deleted_with_identity.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 05:43:03.727761870 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/S22_ledger_deleted_with_identity/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 06:35:17.396624030 +0000
@@ -181,6 +181,22 @@
 revoke execute on function public.record_scored_shot_in_ledger()
   from public, anon, authenticated;
 
+create or replace function public.mutant_drop_ledger_on_identity_delete()
+returns trigger
+language plpgsql
+security definer
+set search_path = ''
+as $$
+begin
+  delete from public.free_rating_ledger
+   where identity_hash = public.free_rating_identity_hash(old.provider, old.provider_id);
+  return old;
+end;
+$$;
+create trigger mutant_drop_ledger_on_identity_delete
+  after delete on auth.identities
+  for each row execute function public.mutant_drop_ledger_on_identity_delete();
+
 drop trigger if exists shots_record_free_rating_ledger on public.shots;
 create trigger shots_record_free_rating_ledger
   after insert or update of result_kind on public.shots
