tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/S28_access_state_premium_default_true.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 05:43:03.727761870 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/S28_access_state_premium_default_true/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 06:36:15.004626777 +0000
@@ -220,7 +220,7 @@
       select b.premium and (b.expires_at is null or b.expires_at > now())
       from public.billing_entitlements b
       where b.user_id = (select auth.uid())
-    ), false) as premium,
+    ), true) as premium,
     public.lifetime_scored_count() as scored_count,
     (
       select count(*)::int from public.analysis_permits p
