tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/S29_access_state_ignores_expiry.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 05:43:03.727761870 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/S29_access_state_ignores_expiry/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 06:36:24.384627225 +0000
@@ -217,7 +217,7 @@
 as $$
   select
     coalesce((
-      select b.premium and (b.expires_at is null or b.expires_at > now())
+      select b.premium
       from public.billing_entitlements b
       where b.user_id = (select auth.uid())
     ), false) as premium,
