tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/S30_reserve_raw_count.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 05:43:03.727761870 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/S30_reserve_raw_count/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 06:36:34.500627707 +0000
@@ -305,7 +305,7 @@
       from public.billing_entitlements b
       where b.user_id = v_uid
     ), false),
-    public.lifetime_scored_count(),
+    (select count(*)::int from public.shots s where s.user_id = v_uid and s.result_kind = 'scored'),
     (
       select count(*)::int from public.analysis_permits p
       where p.user_id = v_uid
