tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/S33_reserve_ignores_premium.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 05:43:03.727761870 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/S33_reserve_ignores_premium/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 06:37:03.360629083 +0000
@@ -316,7 +316,7 @@
 
   v_remaining := 2 - least(v_scored, 2);
 
-  if not v_premium and v_remaining <= v_reserved then
+  if v_remaining <= v_reserved then
     result := 'access.paywall_required';
     return next;
     return;
