tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/S35_reserve_ignores_reserved_permits.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 05:43:03.727761870 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/S35_reserve_ignores_reserved_permits/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 06:37:22.556629998 +0000
@@ -314,6 +314,7 @@
     )
   into v_premium, v_scored, v_reserved;
 
+  v_reserved := 0;
   v_remaining := 2 - least(v_scored, 2);
 
   if not v_premium and v_remaining <= v_reserved then
