tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/S39_apply_backstop_raw_count.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 05:43:03.727761870 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/S39_apply_backstop_raw_count/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 06:38:00.972631830 +0000
@@ -430,7 +430,7 @@
       where b.user_id = v_uid
     ), false) into v_premium;
 
-    if not v_premium and public.lifetime_scored_count() >= 2 then
+    if not v_premium and (select count(*) from public.shots s where s.user_id = v_uid and s.result_kind = 'scored') >= 2 then
       update public.analysis_permits
          set status = 'released', outcome = 'free_limit_exceeded'
        where id = v_permit_id and user_id = v_uid and status = 'reserved';
