tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/S44_apply_backstop_abstentions_too.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 05:43:03.727761870 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/S44_apply_backstop_abstentions_too/supabase/migrations/20260902150000_free_rating_identity_ledger.sql	2026-09-04 06:38:50.364634185 +0000
@@ -423,7 +423,7 @@
   -- slot and the sweep has nothing to collect.
   -- IDENTITY LEDGER: the count is lifetime_scored_count(), so a re-created
   -- account whose identity already spent both ratings is refused here too.
-  if v_result_kind = 'scored' then
+  if true then
     select coalesce((
       select b.premium and (b.expires_at is null or b.expires_at > now())
       from public.billing_entitlements b
