tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/T05_canStart_gte_zero.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/functions/api/index.ts	2026-09-04 06:16:48.560571157 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/T05_canStart_gte_zero/supabase/functions/api/index.ts	2026-09-04 06:40:53.620640063 +0000
@@ -717,7 +717,7 @@
   const entitlements = premium
     ? ["premium", ...billing.activeEntitlements.filter((name) => name !== "premium")]
     : [];
-  const canStartRating = premium || availableToReserve > 0;
+  const canStartRating = premium || availableToReserve >= 0;
   return {
     premium,
     entitlements,
