tools/mutation/free-rating-ledger/results/full-seed20260904/mutants/T08_paywall_not_inverted.diff
--- /home/ubuntu/repos/Pickle-Sensei/supabase/functions/api/index.ts	2026-09-04 06:16:48.560571157 +0000
+++ /home/ubuntu/repos/Pickle-Sensei/artifacts/mutation/free-rating-ledger/full-seed20260904/scratch/T08_paywall_not_inverted/supabase/functions/api/index.ts	2026-09-04 06:41:09.564640823 +0000
@@ -729,7 +729,7 @@
       availableToReserve,
     },
     canStartRating,
-    paywallRequired: !canStartRating,
+    paywallRequired: canStartRating,
   };
 }
 
