tools/mutation/launch-gate/results/baseline-4d812e1a/APP01-getstarted-bypasses-gate.diff
--- a/apps/mobile/App.tsx
+++ b/apps/mobile/App.tsx
@@ -210,7 +210,7 @@
       />
     ) : (
       <WelcomeScreen
-        onGetStarted={() => setPreAuthStage(stageAfterGetStarted())}
+        onGetStarted={() => setPreAuthStage('signin')}
         onSignIn={() => setPreAuthStage('signin')}
       />
     )
