tools/mutation/launch-gate/results/baseline-4d812e1a/APP02-back-bypasses-gate.diff
--- a/apps/mobile/App.tsx
+++ b/apps/mobile/App.tsx
@@ -206,7 +206,7 @@
       <OnboardingScreen
         mode="preauth"
         onFinished={() => setPreAuthStage(stageAfterOnboarding())}
-        onBack={() => setPreAuthStage(stageWhenLeavingOnboarding())}
+        onBack={() => setPreAuthStage('signin')}
       />
     ) : (
       <WelcomeScreen
