tools/mutation/launch-gate/results/baseline-4d812e1a/APP09-no-account-link.diff
--- a/apps/mobile/App.tsx
+++ b/apps/mobile/App.tsx
@@ -211,7 +211,6 @@
     ) : (
       <WelcomeScreen
         onGetStarted={() => setPreAuthStage(stageAfterGetStarted())}
-        onSignIn={() => setPreAuthStage('signin')}
       />
     )
   ) : !profile && hydrateError ? (
