tools/mutation/launch-gate/results/baseline-4d812e1a/APP10-empty-profile-into-app.diff
--- a/apps/mobile/App.tsx
+++ b/apps/mobile/App.tsx
@@ -221,8 +221,6 @@
       detail={hydrateError}
       onRetry={() => void hydrateApp()}
     />
-  ) : !profile ? (
-    <OnboardingScreen />
   ) : (
     <RootNavigator />
   );
