tools/mutation/launch-gate/results/baseline-4d812e1a/APP12-canonical-empty-profile-into-app.diff
--- a/apps/mobile/App.tsx
+++ b/apps/mobile/App.tsx
@@ -221,7 +221,7 @@
       detail={hydrateError}
       onRetry={() => void hydrateApp()}
     />
-  ) : !profile ? (
+  ) : !profile && session.provider === 'guest' ? (
     <OnboardingScreen />
   ) : (
     <RootNavigator />
