tools/mutation/launch-gate/results/baseline-4d812e1a/APP13-hydrate-error-into-app.diff
--- a/apps/mobile/App.tsx
+++ b/apps/mobile/App.tsx
@@ -215,12 +215,7 @@
       />
     )
   ) : !profile && hydrateError ? (
-    <ErrorState
-      dark
-      title="Your coaching profile couldn’t load"
-      detail={hydrateError}
-      onRetry={() => void hydrateApp()}
-    />
+    <RootNavigator />
   ) : !profile ? (
     <OnboardingScreen />
   ) : (
