tools/mutation/launch-gate/results/baseline-4d812e1a/APP14-account-questionnaire-preauth-mode.diff
--- a/apps/mobile/App.tsx
+++ b/apps/mobile/App.tsx
@@ -222,7 +222,7 @@
       onRetry={() => void hydrateApp()}
     />
   ) : !profile ? (
-    <OnboardingScreen />
+    <OnboardingScreen mode="preauth" onFinished={() => {}} onBack={() => {}} />
   ) : (
     <RootNavigator />
   );
