tools/mutation/launch-gate/results/baseline-4d812e1a/APP16-getstarted-consults-profile.diff
--- a/apps/mobile/App.tsx
+++ b/apps/mobile/App.tsx
@@ -210,7 +210,9 @@
       />
     ) : (
       <WelcomeScreen
-        onGetStarted={() => setPreAuthStage(stageAfterGetStarted())}
+        onGetStarted={() =>
+          setPreAuthStage(profile ? 'signin' : stageAfterGetStarted())
+        }
         onSignIn={() => setPreAuthStage('signin')}
       />
     )
