tools/mutation/launch-gate/results/baseline-4d812e1a/OB05-back-finishes.diff
--- a/apps/mobile/src/screens/OnboardingScreen.tsx
+++ b/apps/mobile/src/screens/OnboardingScreen.tsx
@@ -440,7 +440,7 @@
   // here. Neither path skips the questionnaire: it is required.
   const leaveOnboarding = () => {
     if (preAuth) {
-      props.onBack?.();
+      props.onFinished?.();
       return;
     }
     setConfirmingLeave(true);
