tools/mutation/launch-gate/results/final-full-with-pins-4d812e1a/APP03-finished-to-welcome.diff
--- a/apps/mobile/App.tsx
+++ b/apps/mobile/App.tsx
@@ -205,7 +205,7 @@
     ) : preAuthStage === 'onboarding' ? (
       <OnboardingScreen
         mode="preauth"
-        onFinished={() => setPreAuthStage(stageAfterOnboarding())}
+        onFinished={() => setPreAuthStage('welcome')}
         onBack={() => setPreAuthStage(stageWhenLeavingOnboarding())}
       />
     ) : (
