tools/mutation/launch-gate/results/final-full-with-pins-4d812e1a/APP07-preauth-mode-dropped.diff
--- a/apps/mobile/App.tsx
+++ b/apps/mobile/App.tsx
@@ -204,7 +204,6 @@
       <SignInScreen onBack={() => setPreAuthStage('welcome')} />
     ) : preAuthStage === 'onboarding' ? (
       <OnboardingScreen
-        mode="preauth"
         onFinished={() => setPreAuthStage(stageAfterOnboarding())}
         onBack={() => setPreAuthStage(stageWhenLeavingOnboarding())}
       />
