tools/mutation/launch-gate/results/final-full-with-pins-4d812e1a/APP08-account-link-enters-questionnaire.diff
--- a/apps/mobile/App.tsx
+++ b/apps/mobile/App.tsx
@@ -211,7 +211,7 @@
     ) : (
       <WelcomeScreen
         onGetStarted={() => setPreAuthStage(stageAfterGetStarted())}
-        onSignIn={() => setPreAuthStage('signin')}
+        onSignIn={() => setPreAuthStage(stageAfterGetStarted())}
       />
     )
   ) : !profile && hydrateError ? (
