tools/mutation/launch-gate/results/final-full-with-pins-4d812e1a/APP11-guest-empty-profile-into-app.diff
--- a/apps/mobile/App.tsx
+++ b/apps/mobile/App.tsx
@@ -221,7 +221,7 @@
       detail={hydrateError}
       onRetry={() => void hydrateApp()}
     />
-  ) : !profile ? (
+  ) : !profile && session.provider !== 'guest' ? (
     <OnboardingScreen />
   ) : (
     <RootNavigator />
