tools/mutation/launch-gate/results/final-full-with-pins-4d812e1a/AS03-stash-not-cleared.diff
--- a/apps/mobile/src/state/appStore.ts
+++ b/apps/mobile/src/state/appStore.ts
@@ -171,7 +171,6 @@
               : pending;
           raw = JSON.stringify(adopted);
           await setKv(db, profileKeyForOwner(owner), raw);
-          await setKv(db, PENDING_ONBOARDING_PROFILE_KV_KEY, '');
           pending = null;
         } catch {
           // Stash and existing profile both survive for the next attempt.
