tools/mutation/launch-gate/results/final-full-with-pins-4d812e1a/OB01-skip-button-literal.diff
--- a/apps/mobile/src/screens/OnboardingScreen.tsx
+++ b/apps/mobile/src/screens/OnboardingScreen.tsx
@@ -491,6 +491,18 @@
         <Text style={[type.micro, styles.stepCount]}>
           {stepIndex + 1}/{STEPS.length}
         </Text>
+        {preAuth ? (
+          <PressableScale
+            accessibilityRole="button"
+            accessibilityLabel="Skip"
+            accessibilityHint="Skip setup and sign in"
+            hitSlop={12}
+            onPress={() => props.onFinished?.()}
+            style={styles.headerButton}
+          >
+            <Text style={[type.micro, styles.stepCount]}>Skip</Text>
+          </PressableScale>
+        ) : null}
       </View>
 
       {step !== 'reveal' && step !== 'notifications' ? (
