tools/mutation/launch-gate/results/final-full-with-pins-4d812e1a/OB11-preauth-saves-instead-of-stash.diff
--- a/apps/mobile/src/screens/OnboardingScreen.tsx
+++ b/apps/mobile/src/screens/OnboardingScreen.tsx
@@ -423,8 +423,8 @@
         setNotificationChoice(choice);
       }
       if (preAuth) {
-        const ok = await completePreAuthOnboarding(answeredProfile);
-        if (ok) props.onFinished?.();
+        await completeOnboarding(answeredProfile);
+        props.onFinished?.();
         return;
       }
       await completeOnboarding(answeredProfile);
