tools/mutation/launch-gate/results/final-full-with-pins-4d812e1a/OB13-steps-reordered.diff
--- a/apps/mobile/src/screens/OnboardingScreen.tsx
+++ b/apps/mobile/src/screens/OnboardingScreen.tsx
@@ -36,9 +36,9 @@
 const STEPS = [
   'name',
   'gender',
-  'level',
-  'handedness',
   'goal',
+  'handedness',
+  'level',
   'problem',
   'reveal',
   'notifications',
