tools/mutation/launch-gate/results/final-full-with-pins-4d812e1a/OB19-progress-tap-hands-off.diff
--- a/apps/mobile/src/screens/OnboardingScreen.tsx
+++ b/apps/mobile/src/screens/OnboardingScreen.tsx
@@ -488,7 +488,10 @@
         <View style={styles.progressWrap}>
           <ProgressBar step={stepIndex} total={STEPS.length} />
         </View>
-        <Text style={[type.micro, styles.stepCount]}>
+        <Text
+          style={[type.micro, styles.stepCount]}
+          onPress={preAuth ? () => props.onFinished?.() : undefined}
+        >
           {stepIndex + 1}/{STEPS.length}
         </Text>
       </View>
