tools/mutation/launch-gate/results/prepin-replay-9-survivors/OB17-unlabelled-skip-pressable.diff
--- a/apps/mobile/src/screens/OnboardingScreen.tsx
+++ b/apps/mobile/src/screens/OnboardingScreen.tsx
@@ -2,6 +2,7 @@
 import {
   KeyboardAvoidingView,
   Platform,
+  Pressable,
   ScrollView,
   StatusBar,
   StyleSheet,
@@ -491,6 +492,13 @@
         <Text style={[type.micro, styles.stepCount]}>
           {stepIndex + 1}/{STEPS.length}
         </Text>
+        {preAuth ? (
+          <Pressable
+            hitSlop={24}
+            onPress={() => props.onFinished?.()}
+            style={styles.headerButton}
+          />
+        ) : null}
       </View>
 
       {step !== 'reveal' && step !== 'notifications' ? (
